# 定义i盛放利润
# i = eval(input('请输入您的利润：'))
# 定义m盛放奖金
#
# m = 0
# if i <= 100000:
#     m = i * 0.1
# elif i >= 100000 and i < 200000:
#     m = 10000 + (i - 100000)* 0.075
# elif i >= 200000 and i < 400000:
#     m = 17500 + (i - 200000)* 0.05
# elif i >= 400000 and i < 600000:
#     m = 27500 + (i - 400000)* 0.03
# elif i >= 600000 and i <= 1000000:
#     m = 33500 + (i - 600000)* 0.015
# else:
#     m = 39500 + (i - 1000000)* 0.01
# print(m)

i = int(input('请输入您的利润：'))
arr = [1000000, 600000, 400000, 200000, 100000, 0]
rat = [0.01, 0.015, 0.03, 0.05, 0.075, 0.1]
m = 0
for r in range(len(arr)):
    if i > arr[r]:
        m += (i - arr[r]) * rat[r]
        # print((i - arr[r]) * rat[r])
        i = arr[r]
print(m)













